<template>
  <div>
    <add-effect @add-effect='addEffect' class="row justify-content-md-center"></add-effect>
    <div class="list-group">
      <ul
        v-for="(effect, index) in negativeEffects"
        :key="index"
        >
        <effect-list-item
          class="list-group-item"
          :index='index'
          :effect='effect.Text'>
        </effect-list-item>
      </ul>
    </div>
  </div>
</template>
<script>
import AddEffect from './AddEffect.vue'
import EffectListItem from './EffectListItem.vue'

export default {
  components: {
    AddEffect,
    EffectListItem
  },
  data () {
    return {
      negativeEffects: [
        {
          id: 1,
          Text: 'Дикая магия. После каждого хода персонажей кидается д20. Если выпало >10, кидаем таблицу дикой магии'
        },
        {
          id: 2,
          Text: 'Вожак'
        },
        {
          id: 3,
          Text: 'Больше здоровья у врагов'
        },
        {
          id: 4,
          Text: 'Минус на д6 к КД'
        },
        {
          id: 5,
          Text: 'Минус на д4 к КД'
        },
        {
          id: 6,
          Text: 'Орда мелюзги'
        },
        {
          id: 7,
          Text: 'Противники невидимы'
        },
        {
          id: 8,
          Text: 'Только одно действие в ход первые д4 хода (Реакция работает)'
        },
        {
          id: 9,
          Text: 'Немота. Нельзя использовать устный компонент'
        },
        {
          id: 10,
          Text: 'Немота. Нельзя обсуждать стратегию в ходе боя'
        },
        {
          id: 11,
          Text: 'Ловушки (усиленные)'
        },
        {
          id: 12,
          Text: 'Враги могут ударить в ответ'
        },
        {
          id: 13,
          Text: 'У врагов есть д6 легендарных действий'
        },
        {
          id: 14,
          Text: 'У врагов есть д8 легендарных действий'
        },
        {
          id: 15,
          Text: 'Труднопроходимая местность'
        },
        {
          id: 15,
          Text: 'У врагов крит на 19-20'
        },
        {
          id: 15,
          Text: 'Враги могут ломать снаряжение героев'
        },
        {
          id: 16,
          Text: 'Вы меняетесь героями'
        },
        {
          id: 17,
          Text: 'Ваше снаряжение лежит в центре арены (Надевается свободным действием)'
        },
        {
          id: 18,
          Text: 'Вожак'
        },
        {
          id: 19,
          Text: 'У врагов есть животные'
        }
      ],
      positiveEffects: [
        {
          id: 1,
          Text: 'Крит на 19-20'
        },
        {
          id: 2,
          Text: 'Крит на 18-20'
        },
        {
          id: 3,
          Text: 'У героев д4 легендарных действий'
        },
        {
          id: 4,
          Text: 'Больше золота за победу'
        },
        {
          id: 5,
          Text: 'Можно перекинуть выпавшие сокровища'
        },
        {
          id: 6,
          Text: 'Получить снаряжение следующего уровня героизма'
        },
        {
          id: 7,
          Text: 'Перебросить стоимость снаряжения'
        },
        {
          id: 8,
          Text: 'Благословение Валгаллы. Это благословение дарует вам способность призывать духов воителей, как если бы вы подули в серебряный рог Валгаллы.'
        },
        {
          id: 9,
          Text: 'Благословение затягивающихся ран. Это благословение даёт вам преимущества медальона затягивающихся ран.'
        },
        {
          id: 10,
          Text: 'Благословение защиты. Вы получаете бонус +1 к КД и спасброскам.'
        },
        {
          id: 11,
          Text: 'Благословение здоровья. Ваше значение Телосложения увеличивается на 2, с максимумом 22.'
        },
        {
          id: 12,
          Text: 'Благословение понимания. Ваше значение Мудрости увеличивается на 2, с максимумом 22.'
        },
        {
          id: 13,
          Text: 'Благословение сопротивления магии. Вы совершаете с преимуществом спасброски от заклинаний и прочих магических эффектов.'
        },
        {
          id: 14,
          Text: 'Благословение улучшения оружия. Одно немагическое оружие, принадлежащее вам, становится оружием +1, пока вы его используете.'
        },
        {
          id: 15,
          Text: 'Чары восстановления. У этих чар 6 зарядов. Вы можете действием потратить часть зарядов на накладывание одного из следующих заклинаний: высшее восстановление (4 заряда) или малое восстановление (2 заряда). Когда все заряды будут потрачены, чары исчезнут.'
        },
        {
          id: 16,
          Text: 'Чары героизма. Эти чары позволяют вам действием получить преимущество зелья героизма.'
        },
        {
          id: 17,
          Text: 'Чары живучести. Эти чары позволяют вам действием получить преимущество зелья живучести.'
        },
        {
          id: 18,
          Text: 'Чары падения пёрышком. Эти чары дают вам преимущества кольца падения пёрышком.'
        },
        {
          id: 19,
          Text: 'Чары призыва животных. Эти чары позволяют вам действием накладывать призыв животных (версию 3 уровня). После трёх использований вы теряете эти чары.'
        },
        {
          id: 20,
          Text: 'Чары тёмного зрения. Эти чары позволяют вам действием накладывать тёмное зрение, без компонентов. После трёх использований вы теряете эти чары.'
        },
        {
          id: 21,
          Text: 'Чары убийцы. Один меч, принадлежащий вам, на следующие 9 дней становится убийцей великанов или убийцей драконов (на выбор Мастера).'
        },
        {
          id: 22,
          Text: 'Д4 вдохновления'
        }
      ]
    }
  },
  methods: {
    addEffect (effect) {
      this.negativeEffects.push(effect)
    }
  }
}
</script>
